// Клас котів. Кіт характеризується життєвою енергією та віком.
// Кіт може спати, бігти за мишею
// (тільки бігти, жодна миша постраждати не повинна!), їсти.
// Під час цих процесів змінюється життєва енергія та вік кота.
// Якщо кіт стає дуже старий або дуже виснажений
// чи навпаки отримує забагато життєвої енергії,
// то він уходить в астрал.
// Розробити клас, що моделює котів, та написати програму,
// яка моделює життя деякого кота:
// спить, біжить за мишею, ще раз біжить за мишею, їсть, спить.
// Примітка. Енергію та вік вимірюємо в умовних одиницях.
// Енергія задається дійсним значенням, вік — цілим.

class Cat {
 public:
  Cat() = default;
  Cat(int age_, double energy_);
  Cat(const Cat&);
  Cat& operator=(const Cat&);
  void sleep() noexcept;
  void run() noexcept;
  void eat() noexcept;
  void print_state();

 private:
  bool astral = false;
  int age = 1;
  double energy = 100;
  const double max_energy = 200;
  bool check_astral() noexcept;
};