// Бібліотека. У бібліотеці є 10 однакових підручників з мови C++,
// які, за наявності, вона видає студентам, а вони надалі можуть їх повертати.
// Бібліотека будує відносини на довірі і не фіксує особистості студентів.
// Написати клас Бібліотека, який виконує операції «видати підручник»,
// «забрати підручник». На початку в бібліотеці наявні усі 10 примірників.
#pragma once

class Library {
 public:
  Library(int initial_books);
  bool lend_book();
  bool return_book();

 private:
  const int max_books = 10;
  int num_books = max_books;
};